In [1]:
import pandas as pd
df = pd.read_csv("tt.csv")
df

  State Company  EmpCount Ownbuilding
0    AP     TCS      1000         yes
1    KA     CTS      2000          no
2    TN   Wipro      3000         yes
3    MP      TM      4000          no
4    UP      MS      5000         yes
5    WB  Harman      6000          no
6   KER  Airbus      7000         yes
7   GUJ   Intel      8000          no
8   MAH  Syntel      9000         yes

In [2]:
from sklearn.model_selection import train_test_split

In [3]:
X = df.iloc[:, 0:3] # Seperating dataframe with only source/input columns and all rows 
Y = df.iloc[:, 3] # seperating dataframe with output column and all rows

In [4]:
X

  State Company  EmpCount
0    AP     TCS      1000
1    KA     CTS      2000
2    TN   Wipro      3000
3    MP      TM      4000
4    UP      MS      5000
5    WB  Harman      6000
6   KER  Airbus      7000
7   GUJ   Intel      8000
8   MAH  Syntel      9000

In [5]:
Y

0    yes
1     no
2    yes
3     no
4    yes
5     no
6    yes
7     no
8    yes
Name: Ownbuilding, dtype: object

In [16]:
X_train, X_test, y_train, y_test = train_test_split(X, Y, train_size=0.7,test_size=0.3, random_state = 0)

In [17]:
X_train

  State Company  EmpCount
4    UP      MS      5000
8   MAH  Syntel      9000
6   KER  Airbus      7000
3    MP      TM      4000
0    AP     TCS      1000
5    WB  Harman      6000

In [18]:
X_test

  State Company  EmpCount
7   GUJ   Intel      8000
2    TN   Wipro      3000
1    KA     CTS      2000

In [19]:
y_train

4    yes
8    yes
6    yes
3     no
0    yes
5     no
Name: Ownbuilding, dtype: object

In [20]:
y_test

7     no
2    yes
1     no
Name: Ownbuilding, dtype: object